opensoap/samples/Security/encrypt.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><t:Transaction xmlns:t="some-URI" mustUnderstand="1" actor="http://www.w3.org/2001/06/soap-envelope/actor/next" nanika="">5</t:Transaction><SOAP-SEC:Signature xmlns:SOAP-SEC="http://schemas.xmlsoap.org/soap/security/2000-12" actor="some-URI" mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/TR/2000/CR-xml-c14n-20001026"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#Body"><Transforms><Transform Algorithm="http://www.w3.org/TR/2000/CR-xml-c14n-20001026"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>tUrs77N0TQDKeVktQaYUrX6cETE=</DigestValue></Reference></SignedInfo><SignatureValue>YIxVxiydsKsys44Ab7yFtCwfgRUZqVk+AfXZ3KT/k524a2ZG/9R0xQcK9BZSRWOpiZJ0mpH4jevjHy7MptCCcsiYXqr1AOhiXmQfKBFpjvxsupNp25iKiKud94nv9Z7LVmZclFTRF6M4QtL36A9JW79LOfqNm95ia/2HB6X+9IY=</SignatureValue></ds:Signature></SOAP-SEC:Signature></SOAP-ENV:Header><SOAP-ENV:Body><m:Add xmlns:m="http://tempuri.org/message/"><A xmlns:s="http://security.opensoap.jp/1.0/" s:encrypt="true">jp0VHwpofmucsfwqdK0/Thv5l0ssfsq5NnMDJnQcKTM+xfTrDxVvAuzAfeE32+dlFLD/gYZfCODH/CRQ21qFICOLfgtZlhsLWjrgMHYdtzba+nzTCD+zIf82IyTPVUebcOFjrxxdXvZpv0oev4OJ6qK5r0b+MUsUea66jtzEEeA=</A><B xmlns:s="http://security.opensoap.jp/1.0/" s:encrypt="true">hhR6Bi4s6lnPrC0ZwjSX5t73FEWBaArXsmCMk3bBD5c/wwwRwdqwXa3BgrPDdRkgGSaCk7GKq4VbUZjVxcVpNr9lZZKQNEaFpnpfciGnt+Wf6v1ImsplY1imZE0Ro229kyH8t8aL0qOfhreUnoBWiMuIuEh+eBF2uU3w3P5VD68=</B></m:Add></SOAP-ENV:Body></SOAP-ENV:Envelope>